# Solved by Владимир Д.

# Для какого наименьшего натурального числа А логическое выражение
# (y < A) ∧ (4x < A) ∨ (237623 < 3y + 5x)
# тождественно истинно (т. е. принимает значение 1) при любых целых положительных x и у?

# 3y = 237623 - 5x -> y = (237623 - 5x) / 3


def check(A):
    for x in range(1, 80_000):
        y = (237623 - 5 * x) // 3
        if y >= 1:
            f = (y < A) and (4 * x < A) or (237623 < 3 * y + 5 * x)
            if f == 0:
                return 0

    return 1


for A in range(191001 - 1000, 10**8):
    if check(A):
        print(A)
        break
