# Solved by Константин Х.


for x in range(0, 17):
    c1 = (
        8 * 17**7
        + 1 * 17**6
        + 9 * 17**5
        + x * 17**4
        + 6 * 17**3
        + x * 17**2
        + 3 * 17
        + 2
    )
    c2 = (
        4 * 17**8
        + 5 * 17**7
        + 6 * 17**6
        + 5 * 17**5
        + 6 * 17**4
        + 9 * 17**3
        + 2 * 17**2
        + 5 * 17
        + x
    )
    c3 = (
        7 * 17**7
        + 7 * 17**6
        + 1 * 17**5
        + 3 * 17**4
        + 7 * 17**3
        + 7 * 17**2
        + x * 17
        + 1
    )
    if (c1 + c2 + c3) % 16 == 0:
        print((c1 + c2 + c3) / 16)

# Solved by София


import string

for x in string.printable[:17]:
    a = int(f"819{x}6{x}32", 17)
    b = int(f"45656925{x}", 17)
    c = int(f"771377{x}1", 17)
    if (a + b + c) % 16 == 0:
        print((a + b + c) // 16, x)
